"use strict";

// const number = 4;        Число.
// const persone = "Alex";  Строка пишется с ковычками '', "", ``.
// const bool = true;       Логическое значение Да.
// const bool2 = false;     Логическое значение нет.

// Объект через фигурные скобки { }.всегда пара,значение : ключ.
// const obj = {
// name: "John",
// age: 25,
// isMarried: false
// };

// Массивы через кводратные скобки[].Считаются по порядку с 0.
// let arr = ['plum.png', 'orange.jpg', 'apple.bmp'];

// const test = alert('Hello');                 Показывает сообщение.
// const answer = prompt('Вам есть 18?', '18'); Показывает сообщение и запрашивает ввод текста от пользователя.
// const result = confirm('Are you here?');     Показывает сообщение и ждёт, пока пользователь нажмёт OK или Отмена.

// Конкатенация - это объединение двух или более строк в одну большую.Пишется ${…}.
// const category = 'toys';
// console.log(`https://someurl.com/${category}/5`);
// const user = 'Leha';
// alert(`Привет, ${user}`);

// =   Присваевание.
// ==  Сравнить по значению.
// === Сравнить по значению и по типу данных.
// &&  И.
// ||  Или.
// !   Отрицание.

// Increment++; Увеличивает переменную на 1.
// Decrement--; Уменьшает переменную на 1.
// counter++;  Постфиксная форма.
// ++counter;  Префиксная форма.









